
/**
通用的省市联动JS(展会版)
使用方法：
初始化：_MyMVC_citySelect.init(pId,cId,def)
pId:省的下拉菜单ID
cId:市的下拉菜单ID 
def:为默认的已先择值 可选
def[0] 省的默认值 
def[1] 市的默认值 
例：
_MyMVC_citySelect.init("province","city",["110","110102"]);
_MyMVC_citySelect.init("province","city",["110"]);
_MyMVC_citySelect.init("province","city",[]);
_MyMVC_citySelect.init("province","city",["110","110102"],["省份","城市"]);

重置为默认状态：
_MyMVC_citySelect.reset();

 一个页面中有多个时：
var citySelect01=new _New_cityProvinceExpo();
citySelect01.init("province","city",["",""],["省份","城市"]);

 
var citySelect02=new _New_cityProvinceExpo();
citySelect02.init("province2","city2",["",""],["省份","城市"]);

实例:
<select id="province" name="province"></select>
<select id="city" name="city"></select>
<script language="javascript">
_MyMVC_citySelect.init("province","city",["101101","101101101"]);
*/
function   _New_cityProvinceExpo()
{
	this.pc=[];
	this.def=[];
	this.p=null;
	this.c=null;
	this.cId=null;
	this.isTips=true;
	this.initStart=0;
	this.init=function (pId,cId,def,optDef)
	{
		var optsDef = optDef || ["省份","城市名"];
		if (this.isTips) 
		{
			this.pc[0]= new Array(optsDef[0],"|"+optsDef[1]);
		}
		else
		{
			this.initStart=1;	
		}
		this.cId=cId;

		this.pc[1] = new Array("北京市-101","|城市名-0|北京市-101101");
		this.pc[2] = new Array("天津市-102","|城市名-0|天津市-102101");
		this.pc[3] = new Array("河北省-103","|城市名-0|石家庄市-103101|唐山市-103102|秦皇岛市-103103|邯郸市-103104|邢台市-103105|保定市-103106|张家口市-103107|承德市-103108|沧州市-103109|廊坊市-103110");
		this.pc[4] = new Array("山西省-104","|城市名-0|太原市-104101|大同市-104102|阳泉市-104103|长治市-104104|晋城市-104105|朔州市-104106|晋中市-104107|运城市-104108|忻州市-104109|临汾市-104110|吕梁市-104111");
		this.pc[5] = new Array("内蒙古-105","|城市名-0|呼和浩特市-105101|包头市-105102|乌海市-105103|赤峰市-105104|通辽市-105105|鄂尔多斯市-105106|呼伦贝尔市-105107|巴彦淖尔市-105108|乌兰察布市-105109|兴安盟-105110|锡林郭勒盟-105111|阿拉善盟-105112");
		this.pc[6] = new Array("辽宁省-106","|城市名-0|沈阳市-106101|大连市-106102|鞍山市-106103|抚顺市-106104|本溪市-106105|丹东市-106106|锦州市-106107|营口市-106108|阜新市-106109|辽阳市-106110|盘锦市-106111|铁岭市-106112|朝阳市-106113|葫芦岛市-106114");
		this.pc[7] = new Array("吉林省-107","|城市名-0|长春市-107101|吉林市-107102|四平市-107103|辽源市-107104|通化市-107105|白山市-107106|松原市-107107|白城市-107108|延边朝鲜族自治州-107109");
		this.pc[8] = new Array("黑龙江-108","|城市名-0|哈尔滨市-108101|齐齐哈尔市-108102|鸡西市-108103|鹤岗市-108104|双鸭山市-108105|大庆市-108106|伊春市-108107|佳木斯市-108108|七台河市-108109|牡丹江市-108110|黑河市-108111|绥化市-108112|大兴安岭地区-108113");
		this.pc[9] = new Array("上海市-109","|城市名-0|上海市-109101");
		this.pc[10] = new Array("江苏省-110","|城市名-0|南京市-110101|无锡市-110102|徐州市-110103|常州市-110104|苏州市-110105|南通市-110106|连云港市-110107|淮安市-110108|盐城市-110109|扬州市-110110|镇江市-110111|泰州市-110112|宿迁市-110113");
		this.pc[11] = new Array("浙江省-111","|城市名-0|杭州市-111101|宁波市-111102|温州市-111103|嘉兴市-111104|湖州市-111105|绍兴市-111106|金华市-111107|衢州市-111108|舟山市-111109|台州市-111110|丽水市-111111");
		this.pc[12] = new Array("安徽省-112","|城市名-0|合肥市-112101|芜湖市-112102|蚌埠市-112103|淮南市-112104|马鞍山市-112105|淮北市-112106|铜陵市-112107|安庆市-112108|黄山市-112109|滁州市-112110|阜阳市-112111|宿州市-112112|巢湖市-112113|六安市-112114|亳州市-112115|池州市-112116|宣城市-112117");
		this.pc[13] = new Array("福建省-113","|城市名-0|福州市-113101|厦门市-113102|莆田市-113103|三明市-113104|泉州市-113105|漳州市-113106|南平市-113107|龙岩市-113108|宁德市-113109");
		this.pc[14] = new Array("江西省-114","|城市名-0|南昌市-114101|景德镇市-114102|萍乡市-114103|九江市-114104|新余市-114105|鹰潭市-114106|赣州市-114107|吉安市-114108|宜春市-114109|抚州市-114110|上饶市-114111");
		this.pc[15] = new Array("山东省-115","|城市名-0|济南市-115101|青岛市-115102|淄博市-115103|枣庄市-115104|东营市-115105|烟台市-115106|潍坊市-115107|济宁市-115108|泰安市-115109|威海市-115110|日照市-115111|莱芜市-115112|临沂市-115113|德州市-115114|聊城市-115115|滨州市-115116|荷泽市-115117");
		this.pc[16] = new Array("河南省-116","|城市名-0|郑州市-116101|开封市-116102|洛阳市-116103|平顶山市-116104|安阳市-116105|鹤壁市-116106|新乡市-116107|焦作市-116108|濮阳市-116109|许昌市-116110|漯河市-116111|三门峡市-116112|南阳市-116113|商丘市-116114|信阳市-116115|周口市-116116|驻马店市-116117");
		this.pc[17] = new Array("湖北省-117","|城市名-0|武汉市-117101|黄石市-117102|十堰市-117103|宜昌市-117104|襄樊市-117105|鄂州市-117106|荆门市-117107|孝感市-117108|荆州市-117109|黄冈市-117110|咸宁市-117111|随州市-117112|恩施土家族苗族自治州-117113|省直辖行政单位-117114");
		this.pc[18] = new Array("湖南省-118","|城市名-0|长沙市-118101|株洲市-118102|湘潭市-118103|衡阳市-118104|邵阳市-118105|岳阳市-118106|常德市-118107|张家界市-118108|益阳市-118109|郴州市-118110|永州市-118111|怀化市-118112|娄底市-118113|湘西土家族苗族自治州-118114");
		this.pc[19] = new Array("广东省-119","|城市名-0|广州市-119101|韶关市-119102|深圳市-119103|珠海市-119104|汕头市-119105|佛山市-119106|江门市-119107|湛江市-119108|茂名市-119109|肇庆市-119110|惠州市-119111|梅州市-119112|汕尾市-119113|河源市-119114|阳江市-119115|清远市-119116|东莞市-119117|中山市-119118|潮州市-119119|揭阳市-119120|云浮市-119121");
		this.pc[20] = new Array("广西省-120","|城市名-0|南宁市-120101|柳州市-120102|桂林市-120103|梧州市-120104|北海市-120105|防城港市-120106|钦州市-120107|贵港市-120108|玉林市-120109|百色市-120110|贺州市-120111|河池市-120112|来宾市-120113|崇左市-120114");
		this.pc[21] = new Array("海南省-121","|城市名-0|海口市-121101|三亚市-121102|省直辖县级行政单位-121103");
		this.pc[22] = new Array("重庆市-122","|城市名-0|重庆市-122101");
		this.pc[23] = new Array("四川省-123","|城市名-0|成都市-123101|自贡市-123102|攀枝花市-123103|泸州市-123104|德阳市-123105|绵阳市-123106|广元市-123107|遂宁市-123108|内江市-123109|乐山市-123110|南充市-123111|眉山市-123112|宜宾市-123113|广安市-123114|达州市-123115|雅安市-123116|巴中市-123117|资阳市-123118|阿坝藏族羌族自治州-123119|甘孜藏族自治州-123120|凉山彝族自治州-123121");
		this.pc[24] = new Array("贵州省-124","|城市名-0|贵阳市-124101|六盘水市-124102|遵义市-124103|安顺市-124104|铜仁地区-124105|黔西南布依族苗族自治州-124106|毕节地区-124107|黔东南苗族侗族自治州-124108|黔南布依族苗族自治州-124109");
		this.pc[25] = new Array("云南省-125","|城市名-0|昆明市-125101|曲靖市-125102|玉溪市-125103|保山市-125104|昭通市-125105|丽江市-125106|思茅市-125107|临沧市-125108|楚雄彝族自治州-125109|红河哈尼族彝族自治州-125110|文山壮族苗族自治州-125111|西双版纳傣族自治州-125112|大理白族自治州-125113|德宏傣族景颇族自治州-125114|怒江傈僳族自治州-125115|迪庆藏族自治州-125116");
		this.pc[26] = new Array("西　藏-126","|城市名-0|拉萨市-126101|昌都地区-126102|山南地区-126103|日喀则地区-126104|那曲地区-126105|阿里地区-126106|林芝地区-126107");
		this.pc[27] = new Array("陕西省-127","|城市名-0|西安市-127101|铜川市-127102|宝鸡市-127103|咸阳市-127104|渭南市-127105|延安市-127106|汉中市-127107|榆林市-127108|安康市-127109|商洛市-127110");
		this.pc[28] = new Array("甘肃省-128","|城市名-0|兰州市-128101|嘉峪关市-128102|金昌市-128103|白银市-128104|天水市-128105|武威市-128106|张掖市-128107|平凉市-128108|酒泉市-128109|庆阳市-128110|定西市-128111|陇南市-128112|临夏回族自治州-128113|甘南藏族自治州-128114");
		this.pc[29] = new Array("青海省-129","|城市名-0|西宁市-129101|海东地区-129102|海北藏族自治州-129103|黄南藏族自治州-129104|海南藏族自治州-129105|果洛藏族自治州-129106|玉树藏族自治州-129107|海西蒙古族藏族自治州-129108");
		this.pc[30] = new Array("宁夏省-130","|城市名-0|银川市-130101|石嘴山市-130102|吴忠市-130103|固原市-130104|中卫市-130105");
		this.pc[31] = new Array("新　疆-131","|城市名-0|乌鲁木齐市-131101|克拉玛依市-131102|吐鲁番地区-131103|哈密地区-131104|昌吉回族自治州-131105|博尔塔拉蒙古自治州-131106|巴音郭楞蒙古自治州-131107|阿克苏地区-131108|克孜勒苏柯尔克孜自治州-131109|喀什地区-131110|和田地区-131111|伊犁哈萨克自治州-131112|塔城地区-131113|阿勒泰地区-131114|省直辖行政单位-131115");
		this.pc[32] = new Array("台湾省-132","|城市名-0|台湾省-132101");
		this.pc[33] = new Array("香　港-133","|城市名-0|香港-133101");
		this.pc[34] = new Array("澳　门-134","|城市名-0|澳门特别行政区-134101");
		this.pc[35] = new Array("亚　洲-135","|城市名-0|亚洲-135101|东京-135102|新加坡-135103|迪拜-135104|新德里-135105|首尔-135106");
		this.pc[36] = new Array("欧　洲-136","|城市名-0|欧洲-136101|柏林-136102|科隆-136103");
		this.pc[37] = new Array("北美洲-137","|城市名-0|北美洲-137101|拉斯维加斯-137102");
		this.pc[38] = new Array("南美洲-138","|城市名-0|南美洲-138101");
		this.pc[39] = new Array("大洋洲-139","|城市名-0|大洋洲-139101");
		this.pc[40] = new Array("非　洲-140","|城市名-0|非洲-140101");

		//----------------------------------------------------
		this.p = this.$(pId);
		this.c = this.$(cId);
		def=def || {};
		def[0]= def[0] || false;
		def[1]= def[1] || false;
		def[2]=false;
		this.def=def;
		this.initSelect();
		//----------------------------------------------------
	}
	//------------------------------------------------------
	this.reset=function ()
	{
		this.def[2]=false;
		this.def[3].selected=true; 
		this.showcity(this.def[4]);
	}
	//------------------------------------------------------
	this.initSelect=function ()
	{
		if (this.p) 
		{
		   var me=this;
		   var defIdx=this.initStart;
		   for( var i = this.initStart; i < this.pc.length; i++ ) 
		   {
				e = document.createElement( "option" );
				var provinceSplit = this.pc[i][0].split( "-" );
				e.setAttribute( "value", provinceSplit[1] );
				e.setAttribute( "cp_idx", i );
				if (me.def[0]==provinceSplit[1])
				{
					e.setAttribute( "selected",true); 
					defIdx=i;
					me.def[3]=e;
					me.def[4]=defIdx;
				}
				e.innerHTML = provinceSplit[0];				
				var tmp=i;
				this.p.onchange=function ()
				{
					var idx=this.options[this.selectedIndex].getAttribute("cp_idx");
					//alert(this.id);
					me.showcity(idx);
				}
				this.p.appendChild(e);
		   }
		   this.showcity(defIdx);
		}
		else
		{
			alert("你的省分下拉菜单对象无法获取，可能是ID错误。");
		}
	}
	//------------------------------------------------------
	this.showcity=function (idx) 
	{
		var c = this.c;
		//alert(c.id);
		if (c) {while(c.hasChildNodes()){c.removeChild(c.lastChild);}}
		else
		{
			alert("你的城市下拉菜单对象无法获取，可能是ID错误。");
		}
		var citys = this.pc[idx][1].split( "|" ); 	
		
		for( var i = 1; i < citys.length; i++ ) 
		{
			e = document.createElement( "option" );
			var citySplit = citys[i].split( "-" );
			e.setAttribute( "value", citySplit[1] );
			if (this.def[1]==citySplit[1] && this.def[2]==false)
			{
				e.setAttribute( "selected",true); 
				this.def[2]==true;
			}
			e.innerHTML = citySplit[0];
			c.appendChild(e);
		}
	}
	//------------------------------------------------------
	this.$=function (id){return document.getElementById(id);}
}
//默认的全局实例
var _MyMVC_citySelect=new _New_cityProvinceExpo();