
/**
通用的省市联动JS
使用方法：
初始化：_MyMVC_citySelect.init(pId,cId,def)
pId:省的下拉菜单ID
cId:市的下拉菜单ID 
def:为默认的已先择值 可选
def[0] 省的默认值 
def[1] 市的默认值 
例：
_MyMVC_citySelect.init("province","city",["101101","101101101"]);
_MyMVC_citySelect.init("province","city",["101101"]);
_MyMVC_citySelect.init("province","city",[]);
_MyMVC_citySelect.init("province","city",["101101","101101101"],["省份","城市"]);

重置为默认状态：
_MyMVC_citySelect.reset();

 一个页面中有多个时：
var citySelect01=new _New_cityProvinceSelect();
citySelect01.init("province","city",["101101","101101101"],["省份","城市"]);

 
var citySelect02=new _New_cityProvinceSelect();
citySelect02.init("province2","city2",["",""],["省份","城市"]);

实例:
<select id="province" name="province"></select>
<select id="city" name="city"></select>
<script language="javascript">
_MyMVC_citySelect.init("province","city",["广东","广东"]);
*/
function   _New_cityProvinceSelect()
{
	this.pc=[];
	this.def=[];
	this.p=null;
	this.c=null;
	this.cId=null;
	this.isTips=true;
	this.initStart=0;
	this.init=function (pId,cId,def,optDef)
	{
		var optsDef = optDef || ["请选择省份名-0","请选择城市名-0"];
		if (this.isTips) 
		{
			this.pc[0]= new Array(optsDef[0],"|"+optsDef[1]);
		}
		else
		{
			this.initStart=1;	
		}
		this.cId=cId;

		this.pc[1] = new Array("北京-101101","|请选择城市名-0|北京-101101101");
		this.pc[2] = new Array("天津-101102","|请选择城市名-0|天津-101102101");
		this.pc[3] = new Array("上海-101103","|请选择城市名-0|上海-101103101");
		this.pc[4] = new Array("重庆-101104","|请选择城市名-0|重庆-101104101");
		this.pc[5] = new Array("河北-101105","|请选择城市名-0|石家庄-101105101|唐山-101105102|秦皇岛-101105103|邯郸-101105104|邢台-101105105|保定-101105106|张家口-101105107|承德-101105108|沧州-101105109|廊坊-101105110|衡水-101105111");
		this.pc[6] = new Array("山西-101106","|请选择城市名-0|太原-101106101|大同-101106102|阳泉-101106103|长治-101106104|晋城-101106105|朔州-101106106|晋中-101106107|运城-101106108|忻州-101106109|临汾-101106110|吕梁-101106111");
		this.pc[7] = new Array("河南-101107","|请选择城市名-0|郑州-101107101|开封-101107102|洛阳-101107103|平顶山-101107104|安阳-101107105|鹤壁-101107106|新乡-101107107|焦作-101107108|濮阳-101107109|许昌-101107110|漯河-101107111|三门峡-101107112|南阳-101107113|商丘-101107114|信阳-101107115|周口-101107116|驻马店-101107117|济源-101107118");
		this.pc[8] = new Array("辽宁-101108","|请选择城市名-0|沈阳-101108101|大连-101108102|鞍山-101108103|抚顺-101108104|本溪-101108105|丹东-101108106|锦州-101108107|营口-101108108|阜新-101108109|辽阳-101108110|盘锦-101108111|铁岭-101108112|朝阳-101108113|葫芦岛-101108114");
		this.pc[9] = new Array("吉林-101109","|请选择城市名-0|长春-101109101|吉林-101109102|四平-101109103|辽源-101109104|通化-101109105|白山-101109106|松原-101109107|白城-101109108|延边朝鲜族自治州-101109109");
		this.pc[10] = new Array("黑龙江-101110","|请选择城市名-0|哈尔滨-101110101|齐齐哈尔-101110102|鸡西-101110103|鹤岗-101110104|双鸭山-101110105|大庆-101110106|伊春-101110107|佳木斯-101110108|七台河-101110109|牡丹江-101110110|黑河-101110111|绥化-101110112|大兴安岭-101110113");
		this.pc[11] = new Array("内蒙古-101111","|请选择城市名-0|呼和浩特-101111101|包头-101111102|乌海-101111103|赤峰-101111104|通辽-101111105|鄂尔多斯-101111106|呼伦贝尔-101111107|巴彦淖尔-101111108|乌兰察布-101111109|兴安盟-101111110|锡林郭勒盟-101111111|阿拉善盟-101111112");
		this.pc[12] = new Array("江苏-101112","|请选择城市名-0|南京-101112101|无锡-101112102|徐州-101112103|常州-101112104|苏州-101112105|南通-101112106|连云港-101112107|淮安-101112108|盐城-101112109|扬州-101112110|镇江-101112111|泰州-101112112|宿迁-101112113");
		this.pc[13] = new Array("山东-101113","|请选择城市名-0|济南-101113101|青岛-101113102|淄博-101113103|枣庄-101113104|东营-101113105|烟台-101113106|潍坊-101113107|济宁-101113108|泰安-101113109|威海-101113110|日照-101113111|莱芜-101113112|临沂-101113113|德州-101113114|聊城-101113115|滨州-101113116|菏泽-101113117");
		this.pc[14] = new Array("安徽-101114","|请选择城市名-0|合肥-101114101|芜湖-101114102|蚌埠-101114103|淮南-101114104|马鞍山-101114105|淮北-101114106|铜陵-101114107|安庆-101114108|黄山-101114109|滁州-101114110|阜阳-101114111|宿州-101114112|巢湖-101114113|六安-101114114|亳州-101114115|池州-101114116|宣城-101114117");
		this.pc[15] = new Array("浙江-101115","|请选择城市名-0|杭州-101115101|宁波-101115102|温州-101115103|嘉兴-101115104|湖州-101115105|绍兴-101115106|金华-101115107|衢州-101115108|舟山-101115109|台州-101115110|丽水-101115111");
		this.pc[16] = new Array("福建-101116","|请选择城市名-0|福州-101116101|厦门-101116102|莆田-101116103|三明-101116104|泉州-101116105|漳州-101116106|南平-101116107|龙岩-101116108|宁德-101116109");
		this.pc[17] = new Array("湖北-101117","|请选择城市名-0|武汉-101117101|黄石-101117102|十堰-101117103|宜昌-101117104|襄阳-101117105|鄂州-101117106|荆门-101117107|潜江-101117108|天门-101117109|仙桃-101117110|孝感-101117111|荆州-101117112|黄冈-101117113|咸宁-101117114|随州-101117115|恩施土家族苗族自治州-101117116|神农架林区-101117117");
		this.pc[18] = new Array("湖南-101118","|请选择城市名-0|长沙-101118101|株洲-101118102|湘潭-101118103|衡阳-101118104|邵阳-101118105|岳阳-101118106|常德-101118107|张家界-101118108|益阳-101118109|郴州-101118110|永州-101118111|怀化-101118112|娄底-101118113|湘西土家族苗族自治州-101118114");
		this.pc[19] = new Array("广东-101119","|请选择城市名-0|广州-101119101|韶关-101119102|深圳-101119103|珠海-101119104|汕头-101119105|佛山-101119106|江门-101119107|湛江-101119108|茂名-101119109|肇庆-101119110|惠州-101119111|梅州-101119112|汕尾-101119113|河源-101119114|阳江-101119115|清远-101119116|东莞-101119117|中山-101119118|潮州-101119119|揭阳-101119120|云浮-101119121");
		this.pc[20] = new Array("广西-101120","|请选择城市名-0|南宁-101120101|柳州-101120102|桂林-101120103|梧州-101120104|北海-101120105|防城港-101120106|钦州-101120107|贵港-101120108|玉林-101120109|百色-101120110|贺州-101120111|河池-101120112|来宾-101120113|崇左-101120114");
		this.pc[21] = new Array("江西-101121","|请选择城市名-0|南昌-101121101|景德镇-101121102|萍乡-101121103|九江-101121104|新余-101121105|鹰潭-101121106|赣州-101121107|吉安-101121108|宜春-101121109|抚州-101121110|上饶-101121111");
		this.pc[22] = new Array("四川-101122","|请选择城市名-0|成都-101122101|自贡-101122102|攀枝花-101122103|泸州-101122104|德阳-101122105|绵阳-101122106|广元-101122107|遂宁-101122108|内江-101122109|乐山-101122110|南充-101122111|眉山-101122112|宜宾-101122113|广安-101122114|达州-101122115|雅安-101122116|巴中-101122117|资阳-101122118|阿坝藏族羌族自治州-101122119|甘孜藏族自治州-101122120|凉山彝族自治州-101122121");
		this.pc[23] = new Array("贵州-101123","|请选择城市名-0|贵阳-101123101|六盘水-101123102|遵义-101123103|安顺-101123104|铜仁-101123105|黔西南布依族苗族自治州-101123106|毕节-101123107|黔东南苗族侗族自治州-101123108|黔南布依族苗族自治州-101123109");
		this.pc[24] = new Array("云南-101124","|请选择城市名-0|昆明-101124101|曲靖-101124102|玉溪-101124103|保山-101124104|昭通-101124105|丽江-101124106|普洱-101124107|临沧-101124108|楚雄彝族自治州-101124109|红河哈尼族彝族自治州-101124110|文山壮族苗族自治州-101124111|西双版纳傣族自治州-101124112|大理白族自治州-101124113|德宏傣族景颇族自治州-101124114|怒江傈傈族自治州-101124115|迪庆藏族自治州-101124116");
		this.pc[25] = new Array("西藏-101125","|请选择城市名-0|拉萨-101125101|昌都-101125102|山南-101125103|日喀则-101125104|那曲-101125105|阿里-101125106|林芝-101125107");
		this.pc[26] = new Array("海南-101126","|请选择城市名-0|海口-101126101|三亚-101126102|琼海-101126103|东方-101126104|儋州-101126105|万宁-101126106|文昌-101126107|定安县-101126108|五指山-101126109|屯昌县-101126110|澄迈县-101126111|临高县-101126112|白沙黎族自治县-101126113|昌江黎族自治县-101126114|乐东黎族自治县-101126115|陵水黎族自治县-101126116|琼中黎族苗族自治县-101126117|保亭黎族苗族自治县-101126118|西沙群岛-101126119|南沙群岛-101126120|中沙群岛的岛礁及其海域-101126121");
		this.pc[27] = new Array("陕西-101127","|请选择城市名-0|西安-101127101|铜川-101127102|宝鸡-101127103|咸阳-101127104|渭南-101127105|延安-101127106|汉中-101127107|榆林-101127108|安康-101127109|商洛-101127110");
		this.pc[28] = new Array("甘肃-101128","|请选择城市名-0|兰州-101128101|嘉峪关-101128102|白银-101128103|天水-101128104|武威-101128105|张掖-101128106|平凉-101128107|酒泉-101128108|庆阳-101128109|定西-101128110|陇南-101128111|金昌-101128112|临夏回族自治州-101128113|甘南藏族自治州-101128114");
		this.pc[29] = new Array("宁夏-101129","|请选择城市名-0|银川-101129101|石嘴山-101129102|吴忠-101129103|固原-101129104|中卫-101129105");
		this.pc[30] = new Array("青海-101130","|请选择城市名-0|西宁-101130101|海东-101130102|海北藏族自治州-101130103|黄南藏族自治州-101130104|海南藏族自治州-101130105|果洛藏族自治州-101130106|玉树藏族自治州-101130107|海西蒙古族藏族自治州-101130108");
		this.pc[31] = new Array("新疆-101131","|请选择城市名-0|乌鲁木齐-101131101|克拉玛依-101131102|吐鲁番-101131103|哈密-101131104|昌吉回族自治州-101131105|博尔塔拉蒙古自治州-101131106|巴音郭楞蒙古自治州-101131107|阿克苏-101131108|克孜勒苏柯尔克孜自治州-101131109|喀什-101131110|和田-101131111|伊犁哈萨克自治州-101131112|塔城地区-101131113|阿勒泰地区-101131114|阿拉尔-101131115|石河子-101131116|五家渠-101131117|图木舒克-101131118");
		this.pc[32] = new Array("香港-101132","|请选择城市名-0|香港岛-101132101|九龙-101132102|新界-101132103");
		this.pc[33] = new Array("澳门-101133","|请选择城市名-0|澳门半岛-101133101|澳门离岛-101133102");
		this.pc[34] = new Array("台湾-101134","|请选择城市名-0|台北县-101134101|宜兰县-101134102|桃园县-101134103|新竹县-101134104|苗栗县-101134105|台中县-101134106|彰化县-101134107|南投县-101134108|云林县-101134109|嘉义县-101134110|台南县-101134111|高雄县-101134112|屏东县-101134113|台东县-101134114|花莲县-101134115|澎湖县-101134116|基隆市-101134117|新竹市-101134118|台中市-101134119|嘉义市-101134120|台南市-101134121|台北市-101134122|高雄市-101134123|金门县-101134124|连江县-101134125");

		//----------------------------------------------------
		this.p = this.$(pId);
		this.c = this.$(cId);
		def=def || {};
		def[0]= def[0] || false;
		def[1]= def[1] || false;
		def[2]=false;
		this.def=def;
		this.initSelect();
		//----------------------------------------------------
	}
	//------------------------------------------------------
	this.reset=function ()
	{
		this.def[2]=false;
		this.def[3].selected=true; 
		this.showcity(this.def[4]);
	}
	//------------------------------------------------------
	this.initSelect=function ()
	{
		if (this.p) 
		{
		   var me=this;
		   var defIdx=this.initStart;
		   for( var i = this.initStart; i < this.pc.length; i++ ) 
		   {
				e = document.createElement( "option" );
				var provinceSplit = this.pc[i][0].split( "-" );
				e.setAttribute( "value", provinceSplit[1] );
				e.setAttribute( "cp_idx", i );
				if (me.def[0]==provinceSplit[1])
				{
					e.setAttribute( "selected",true); 
					defIdx=i;
					me.def[3]=e;
					me.def[4]=defIdx;
				}
				e.innerHTML = provinceSplit[0];				
				var tmp=i;
				this.p.onchange=function ()
				{
					var idx=this.options[this.selectedIndex].getAttribute("cp_idx");
					//alert(this.id);
					me.showcity(idx);
				}
				this.p.appendChild(e);
		   }
		   this.showcity(defIdx);
		}
		else
		{
			alert("你的省分下拉菜单对象无法获取，可能是ID错误。");
		}
	}
	//------------------------------------------------------
	this.showcity=function (idx) 
	{
		var c = this.c;
		//alert(c.id);
		if (c) {while(c.hasChildNodes()){c.removeChild(c.lastChild);}}
		else
		{
			alert("你的城市下拉菜单对象无法获取，可能是ID错误。");
		}
		var citys = this.pc[idx][1].split( "|" ); 	
		
		for( var i = 1; i < citys.length; i++ ) 
		{
			e = document.createElement( "option" );
			var citySplit = citys[i].split( "-" );
			e.setAttribute( "value", citySplit[1] );
			if (this.def[1]==citySplit[1] && this.def[2]==false)
			{
				e.setAttribute( "selected",true); 
				this.def[2]==true;
			}
			e.innerHTML = citySplit[0];
			c.appendChild(e);
		}
	}
	//------------------------------------------------------
	this.$=function (id){return document.getElementById(id);}
}
//默认的全局实例
var _MyMVC_citySelect=new _New_cityProvinceSelect();